In [3]:
import numpy as np
import numpy.random as random
import scipy as sp
import pandas as pd
from pandas import Series,DataFrame

# 視覺化函式庫
import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns
%matplotlib inline

# 顯示到小數點後第3位
%precision 3

'%.3f'

In [4]:
# 製作3行3列的資料，設定index與colums
hier_df = DataFrame(
    np.arange(9).reshape((3,3)),
    index = [
        ['a','a','b'], # 第一層索引
        [1,2,2]        # 第二層索引
    ],
    columns = [
        ['Osaka','Tokyo','Osaka'], # 第一層行
        ['Blue','Red','Red']       # 第二層行
    ]
)
hier_df

    Osaka Tokyo Osaka
     Blue   Red   Red
a 1     0     1     2
  2     3     4     5
b 2     6     7     8

In [5]:
# 對index附加名稱
hier_df.index.names = ['key1','key2'] # key1為第一層索引的名稱,key2為第二層索引的名稱
# 對columns附加名稱
hier_df.columns.names = ['city','color'] # city為第一層行的名稱,color為第二層行的名稱
hier_df

city      Osaka Tokyo Osaka
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5
b    2        6     7     8

In [6]:
# 看City為Osaka的資料
hier_df['Osaka']

color      Blue  Red
key1 key2
a    1        0    2
     2        3    5
b    2        6    8

In [7]:
# 每層的摘要統計量：列的總和
# Key2中索引相同的相加
hier_df.sum(level = 'key2', axis = 0)

/var/folders/gr/wkmgmg2d0w7dft51ggc120900000gn/T/ipykernel_1143/325459981.py:2: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  hier_df.sum(level = 'key2', axis = 0)

city  Osaka Tokyo Osaka
color  Blue   Red   Red
key2
1         0     1     2
2         9    11    13

In [8]:
# 行的總和
# color中行相同的相加
hier_df.sum(level = 'color', axis = 1)

/var/folders/gr/wkmgmg2d0w7dft51ggc120900000gn/T/ipykernel_1143/3305716765.py:2: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  hier_df.sum(level = 'color', axis = 1)

color      Blue  Red
key1 key2
a    1        0    3
     2        3    9
b    2        6   15

In [9]:
# 刪除索引為b的資料
hier_df.drop(['b'])

city      Osaka Tokyo Osaka
color      Blue   Red   Red
key1 key2
a    1        0     1     2
     2        3     4     5

#### 練習問題6-1

In [15]:
# 製作3行4列的資料，設定index與colums
hier_df1 = DataFrame(
    np.arange(12).reshape((3,4)),
    index = [
        ['c','d','d'], # 第一層索引
        [1,2,1]        # 第二層索引
    ],
    columns = [
        ['Kyoto','Nagoya','Hokkaido','Kyoto'], # 第一層行
        ['Yellow','Yellow','Red','Blue']       # 第二層行
    ]
)
hier_df1.index.names = ['key1','key2']
hier_df1.columns.names = ['city','color']
hier_df1

city       Kyoto Nagoya Hokkaido Kyoto
color     Yellow Yellow      Red  Blue
key1 key2
c    1         0      1        2     3
d    2         4      5        6     7
     1         8      9       10    11

In [14]:
hier_df1['Kyoto']

color      Yellow  Blue
key1 key2
c    1          0     3
d    2          4     7
     1          8    11

#### 練習問題6-2

In [19]:
hier_df1.mean(level = 'city', axis = 1)

/var/folders/gr/wkmgmg2d0w7dft51ggc120900000gn/T/ipykernel_1143/2320938975.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  hier_df1.mean(level = 'city', axis = 1)

city       Kyoto  Nagoya  Hokkaido
key1 key2
c    1       1.5     1.0       2.0
d    2       5.5     5.0       6.0
     1       9.5     9.0      10.0

In [18]:
hier_df1.sum(level = 'key2', axis = 0)

/var/folders/gr/wkmgmg2d0w7dft51ggc120900000gn/T/ipykernel_1143/736322672.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  hier_df1.sum(level = 'key2', axis = 0)

city   Kyoto Nagoya Hokkaido Kyoto
color Yellow Yellow      Red  Blue
key2
1          8     10       12    14
2          4      5        6     7

### 6-2-2資料的結合

In [4]:
data1 = {
    'Id':['100','101','102','103','104','106','108','110','111','113'],
    'City':['Tokyo','Osaka','Kyoto','Hollaido','Tokyo','Tokyo','Osaka','Kyoto','Hollaido','Tokyo'],
    'Birth_year':[1990,1989,1992,1997,1982,1991,1988,1990,1995,1981],
    'Name':['Hiroshi','Akiko','Yuki','Satoru','Stteeve','Mituru','Aoi','Tarou','Suguru','Mitsuo']
}
df1 = DataFrame(data1)
df1

    Id      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hollaido        1997   Satoru
4  104     Tokyo        1982  Stteeve
5  106     Tokyo        1991   Mituru
6  108     Osaka        1988      Aoi
7  110     Kyoto        1990    Tarou
8  111  Hollaido        1995   Suguru
9  113     Tokyo        1981   Mitsuo

In [24]:
data2 = {
    'Id':['100','101','102','105','107'],
    'Math':[50,43,33,76,98],
    'English':[90,30,20,50,30],
    'Sex':['M','F','F','M','M'],
    'index_num':[0,1,2,3,4]
}
df2 = DataFrame(data2)
df2

    Id  Math  English Sex  index_num
0  100    50       90   M          0
1  101    43       30   F          1
2  102    33       20   F          2
3  105    76       50   M          3
4  107    98       30   M          4

In [25]:
# 資料的合併（內部結合。雖然鍵可自動被識別，以on來明確指定也可以）
print('結合Table')
pd.merge(df1,df2,on = 'Id') # 只有當Id之值在兩邊的DataFrame物件裡都存在的記錄會被顯示

結合Table

    Id   City  Birth_year     Name  Math  English Sex  index_num
0  100  Tokyo        1990  Hiroshi    50       90   M          0
1  101  Osaka        1989    Akiko    43       30   F          1
2  102  Kyoto        1992     Yuki    33       20   F          2

In [26]:
# 資料的結合（全結合）
pd.merge(df1,df2,how = 'outer')

     Id      City  Birth_year     Name  Math  English  Sex  index_num
0   100     Tokyo      1990.0  Hiroshi  50.0     90.0    M        0.0
1   101     Osaka      1989.0    Akiko  43.0     30.0    F        1.0
2   102     Kyoto      1992.0     Yuki  33.0     20.0    F        2.0
3   103  Hollaido      1997.0   Satoru   NaN      NaN  NaN        NaN
4   104     Tokyo      1982.0  Stteeve   NaN      NaN  NaN        NaN
5   106     Tokyo      1991.0   Mituru   NaN      NaN  NaN        NaN
6   108     Osaka      1988.0      Aoi   NaN      NaN  NaN        NaN
7   110     Kyoto      1990.0    Tarou   NaN      NaN  NaN        NaN
8   111  Hollaido      1995.0   Suguru   NaN      NaN  NaN        NaN
9   113     Tokyo      1981.0   Mitsuo   NaN      NaN  NaN        NaN
10  105       NaN         NaN      NaN  76.0     50.0    M        3.0
11  107       NaN         NaN      NaN  98.0     30.0    M        4.0

In [27]:
# 使用index來合併
pd.merge(df1,df2,left_index=True,right_on='index_num') # 將左側的資料之索引，以及右側資料之index_num行作為鍵來指定

  Id_x      City  Birth_year     Name Id_y  Math  English Sex  index_num
0  100     Tokyo        1990  Hiroshi  100    50       90   M          0
1  101     Osaka        1989    Akiko  101    43       30   F          1
2  102     Kyoto        1992     Yuki  102    33       20   F          2
3  103  Hollaido        1997   Satoru  105    76       50   M          3
4  104     Tokyo        1982  Stteeve  107    98       30   M          4

In [28]:
# 資料的結合（左外部結合）
pd.merge(df1,df2,how = 'left') # 當df2沒有對應到df1的資料時為NaN

    Id      City  Birth_year     Name  Math  English  Sex  index_num
0  100     Tokyo        1990  Hiroshi  50.0     90.0    M        0.0
1  101     Osaka        1989    Akiko  43.0     30.0    F        1.0
2  102     Kyoto        1992     Yuki  33.0     20.0    F        2.0
3  103  Hollaido        1997   Satoru   NaN      NaN  NaN        NaN
4  104     Tokyo        1982  Stteeve   NaN      NaN  NaN        NaN
5  106     Tokyo        1991   Mituru   NaN      NaN  NaN        NaN
6  108     Osaka        1988      Aoi   NaN      NaN  NaN        NaN
7  110     Kyoto        1990    Tarou   NaN      NaN  NaN        NaN
8  111  Hollaido        1995   Suguru   NaN      NaN  NaN        NaN
9  113     Tokyo        1981   Mitsuo   NaN      NaN  NaN        NaN

In [29]:
data3 = {
    'Id':['117','118','119','120','125'],
    'City':['Chiba','Kanagawa','Tokyo','Fukuoka','Okinawa'],
    'Birth_year':[1990,1989,1992,1997,1982],
    'Name':['Suguru','Kouichi','Satochi','Yukie','Akari']
}
df3 = DataFrame(data3)
df3

    Id      City  Birth_year     Name
0  117     Chiba        1990   Suguru
1  118  Kanagawa        1989  Kouichi
2  119     Tokyo        1992  Satochi
3  120   Fukuoka        1997    Yukie
4  125   Okinawa        1982    Akari

In [30]:
# concat縱結合
concat_data = pd.concat([df1,df3])
concat_data

    Id      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hollaido        1997   Satoru
4  104     Tokyo        1982  Stteeve
5  106     Tokyo        1991   Mituru
6  108     Osaka        1988      Aoi
7  110     Kyoto        1990    Tarou
8  111  Hollaido        1995   Suguru
9  113     Tokyo        1981   Mitsuo
0  117     Chiba        1990   Suguru
1  118  Kanagawa        1989  Kouichi
2  119     Tokyo        1992  Satochi
3  120   Fukuoka        1997    Yukie
4  125   Okinawa        1982    Akari

#### 練習問題6-4

In [31]:
data4 = {
    'Id':['0','1','2','3','4','6','8','11','12','13'],
    'City':['Tokyo','Osaka','Kyoto','Hollaido','Tokyo','Tokyo','Osaka','Kyoto','Hollaido','Tokyo'],
    'Birth_year':[1990,1989,1992,1997,1982,1991,1988,1990,1995,1981],
    'Name':['Hiroshi','Akiko','Yuki','Satoru','Stteeve','Mituru','Aoi','Tarou','Suguru','Mitsuo']
}
df4 = DataFrame(data4)
df4

   Id      City  Birth_year     Name
0   0     Tokyo        1990  Hiroshi
1   1     Osaka        1989    Akiko
2   2     Kyoto        1992     Yuki
3   3  Hollaido        1997   Satoru
4   4     Tokyo        1982  Stteeve
5   6     Tokyo        1991   Mituru
6   8     Osaka        1988      Aoi
7  11     Kyoto        1990    Tarou
8  12  Hollaido        1995   Suguru
9  13     Tokyo        1981   Mitsuo

In [32]:
data5 = {
    'Id':['0','1','3','6','8'],
    'Math':[20,30,50,70,90],
    'English':[30,50,50,70,20],
    'Sex':['M','F','F','M','M'],
    'index_num':[0,1,2,3,4]
}
df5 = DataFrame(data5)
df5

  Id  Math  English Sex  index_num
0  0    20       30   M          0
1  1    30       50   F          1
2  3    50       50   F          2
3  6    70       70   M          3
4  8    90       20   M          4

In [37]:
pd.merge(df4,df5,on = 'Id')

  Id      City  Birth_year     Name  Math  English Sex  index_num
0  0     Tokyo        1990  Hiroshi    20       30   M          0
1  1     Osaka        1989    Akiko    30       50   F          1
2  3  Hollaido        1997   Satoru    50       50   F          2
3  6     Tokyo        1991   Mituru    70       70   M          3
4  8     Osaka        1988      Aoi    90       20   M          4

In [38]:
pd.merge(df4,df5,how = 'outer')

   Id      City  Birth_year     Name  Math  English  Sex  index_num
0   0     Tokyo        1990  Hiroshi  20.0     30.0    M        0.0
1   1     Osaka        1989    Akiko  30.0     50.0    F        1.0
2   2     Kyoto        1992     Yuki   NaN      NaN  NaN        NaN
3   3  Hollaido        1997   Satoru  50.0     50.0    F        2.0
4   4     Tokyo        1982  Stteeve   NaN      NaN  NaN        NaN
5   6     Tokyo        1991   Mituru  70.0     70.0    M        3.0
6   8     Osaka        1988      Aoi  90.0     20.0    M        4.0
7  11     Kyoto        1990    Tarou   NaN      NaN  NaN        NaN
8  12  Hollaido        1995   Suguru   NaN      NaN  NaN        NaN
9  13     Tokyo        1981   Mitsuo   NaN      NaN  NaN        NaN

In [35]:
data6 = {
    'Id':['70','80','90','120','150'],
    'City':['Chiba','Kanagawa','Tokyo','Fukuoka','Okinawa'],
    'Birth_year':[1980,1999,1995,1994,1984],
    'Name':['Suguru','Kouichi','Satochi','Yukie','Akari']
}
df6 = DataFrame(data6)
df6

    Id      City  Birth_year     Name
0   70     Chiba        1980   Suguru
1   80  Kanagawa        1999  Kouichi
2   90     Tokyo        1995  Satochi
3  120   Fukuoka        1994    Yukie
4  150   Okinawa        1984    Akari

In [36]:
pd.concat([df4,df6])

    Id      City  Birth_year     Name
0    0     Tokyo        1990  Hiroshi
1    1     Osaka        1989    Akiko
2    2     Kyoto        1992     Yuki
3    3  Hollaido        1997   Satoru
4    4     Tokyo        1982  Stteeve
5    6     Tokyo        1991   Mituru
6    8     Osaka        1988      Aoi
7   11     Kyoto        1990    Tarou
8   12  Hollaido        1995   Suguru
9   13     Tokyo        1981   Mitsuo
0   70     Chiba        1980   Suguru
1   80  Kanagawa        1999  Kouichi
2   90     Tokyo        1995  Satochi
3  120   Fukuoka        1994    Yukie
4  150   Okinawa        1984    Akari

#### 6-2-3 資料的操作與變換

In [42]:
# 準備hier_df
hier_df = DataFrame(
    np.arange(9).reshape((3,3)),
    index = [
        ['a','a','b'],
        [1,2,2]
    ],
    columns = [
        ['Osaka','Tokyo','Osaka'],
        ['Blue','Red','Red']
    ]
)
hier_df

    Osaka Tokyo Osaka
     Blue   Red   Red
a 1     0     1     2
  2     3     4     5
b 2     6     7     8

In [43]:
# 藉由樞紐操作將「Blue、Red」之行變更為列
hier_df.stack()

          Osaka  Tokyo
a 1 Blue      0    NaN
    Red       2    1.0
  2 Blue      3    NaN
    Red       5    4.0
b 2 Blue      6    NaN
    Red       8    7.0

In [46]:
# 使用unstack方法將「Blue、Red」之列變更為行
hier_df.stack().unstack()

    Osaka     Tokyo
     Blue Red  Blue  Red
a 1     0   2   NaN  1.0
  2     3   5   NaN  4.0
b 2     6   8   NaN  7.0

In [47]:
# 有著重複的資料
dupli_data = DataFrame({
    'col1':[1,1,2,3,4,4,6,6],
    'col2':['a','b','b','b','c','c','b','b']
})
print('原本的資料')
dupli_data

原本的資料

   col1 col2
0     1    a
1     1    b
2     2    b
3     3    b
4     4    c
5     4    c
6     6    b
7     6    b

In [48]:
# 重複的判斷
# 需要兩行相同的重複出現才算
# 第一次出現的是False，第二次出現的是True
dupli_data.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [49]:
# 將重複的資料刪除
dupli_data.drop_duplicates()

   col1 col2
0     1    a
1     1    b
2     2    b
3     3    b
4     4    c
6     6    b

In [7]:
# 參照資料
city_map = {
    'Tokyo': 'Kanto',
    'Hollaido': 'Hollaido',
    'Osaka': 'Kansai',
    'Kyoto': 'Kansai'
}
city_map

{'Tokyo': 'Kanto',
 'Hollaido': 'Hollaido',
 'Osaka': 'Kansai',
 'Kyoto': 'Kansai'}

In [8]:
# 結合參照資料
# 如果沒有對應的資料，則為NaN
df1['region'] = df1['City'].map(city_map) # 取得對應的區域名稱資料，將它在最右邊新增為region行
df1

    Id      City  Birth_year     Name    region
0  100     Tokyo        1990  Hiroshi     Kanto
1  101     Osaka        1989    Akiko    Kansai
2  102     Kyoto        1992     Yuki    Kansai
3  103  Hollaido        1997   Satoru  Hollaido
4  104     Tokyo        1982  Stteeve     Kanto
5  106     Tokyo        1991   Mituru     Kanto
6  108     Osaka        1988      Aoi    Kansai
7  110     Kyoto        1990    Tarou    Kansai
8  111  Hollaido        1995   Suguru  Hollaido
9  113     Tokyo        1981   Mitsuo     Kanto

In [54]:
# 將birth_year的前3位數字、文字取出
df1['up_two_num'] = df1['Birth_year'].map(lambda x: str(x)[0:3])
df1

    Id      City  Birth_year     Name    region up_two_num
0  100     Tokyo        1990  Hiroshi     Kanto        199
1  101     Osaka        1989    Akiko    Kansai        198
2  102     Kyoto        1992     Yuki    Kansai        199
3  103  Hollaido        1997   Satoru  Hollaido        199
4  104     Tokyo        1982  Stteeve     Kanto        198
5  106     Tokyo        1991   Mituru     Kanto        199
6  108     Osaka        1988      Aoi    Kansai        198
7  110     Kyoto        1990    Tarou    Kansai        199
8  111  Hollaido        1995   Suguru  Hollaido        199
9  113     Tokyo        1981   Mitsuo     Kanto        198

In [56]:
# 分割的粗細程度
birth_year_bins = [1980,1985,1990,1995,2000]

# 進行分箱
birth_year_cut_data = pd.cut(df1.Birth_year, birth_year_bins)
birth_year_cut_data

0    (1985, 1990]
1    (1985, 1990]
2    (1990, 1995]
3    (1995, 2000]
4    (1980, 1985]
5    (1990, 1995]
6    (1985, 1990]
7    (1985, 1990]
8    (1990, 1995]
9    (1980, 1985]
Name: Birth_year, dtype: category
Categories (4, interval[int64, right]): [(1980, 1985] < (1985, 1990] < (1990, 1995] < (1995, 2000]]

In [57]:
# 統計結果
pd.value_counts(birth_year_cut_data)

(1985, 1990]    4
(1990, 1995]    3
(1980, 1985]    2
(1995, 2000]    1
Name: Birth_year, dtype: int64

In [59]:
# 加上名稱
group_names = ['early1980s','late1980s','early1990s','late1990s']
birth_year_cut_data = pd.cut(df1.Birth_year,birth_year_bins,labels = group_names)
pd.value_counts(birth_year_cut_data)

late1980s     4
early1990s    3
early1980s    2
late1990s     1
Name: Birth_year, dtype: int64

In [60]:
# 也能以數字來指定分割的數量。在這裡每2個進行分割
pd.cut(df1.Birth_year,2)

0      (1989.0, 1997.0]
1    (1980.984, 1989.0]
2      (1989.0, 1997.0]
3      (1989.0, 1997.0]
4    (1980.984, 1989.0]
5      (1989.0, 1997.0]
6    (1980.984, 1989.0]
7      (1989.0, 1997.0]
8      (1989.0, 1997.0]
9    (1980.984, 1989.0]
Name: Birth_year, dtype: category
Categories (2, interval[float64, right]): [(1980.984, 1989.0] < (1989.0, 1997.0]]

In [64]:
# 以分位點進行分割
pd.value_counts(pd.qcut(df1.Birth_year,2))

(1980.999, 1990.0]    6
(1990.0, 1997.0]      4
Name: Birth_year, dtype: int64

#### 練習問題6-7

In [22]:
pwd

'/Users/yexiangyu/Desktop/東京大學資料科學家養成全書/Ch6_使用Pandas進行資料加工處理'

In [23]:
cd /Users/yexiangyu/Desktop/東京大學資料科學家養成全書/Ch3_敘述統計與簡單回歸分析/chap3

/Users/yexiangyu/Desktop/東京大學資料科學家養成全書/Ch3_敘述統計與簡單回歸分析/chap3

In [24]:
pwd

'/Users/yexiangyu/Desktop/東京大學資料科學家養成全書/Ch3_敘述統計與簡單回歸分析/chap3'

In [79]:
student_data_math = pd.read_csv('student-mat.csv',sep=';')
student_data_math['dbage'] = student_data_math['age'].map(lambda x: 2*x)
student_data_math

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3,dbage
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,3,4,1,1,3,6,5,6,6,36
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,3,3,1,1,3,4,5,5,6,34
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,3,2,2,3,3,10,7,8,10,30
3,GP,F,15,U,GT3,T,4,2,health,services,...,2,2,1,1,5,2,15,14,15,30
4,GP,F,16,U,GT3,T,3,3,other,other,...,3,2,1,2,5,4,6,10,10,32
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,...,5,4,4,5,4,11,9,9,9,40
391,MS,M,17,U,LE3,T,3,1,services,services,...,4,5,3,4,2,3,14,16,16,34
392,MS,M,21,R,GT3,T,1,1,other,other,...,5,3,3,3,3,3,10,8,7,42
393,MS,M,18,R,LE3,T,3,2,services,other,...,4,1,3,4,5,0,11,12,10,36
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,2,3,3,3,5,5,8,9,9,38

#### 練習問題6-8

In [81]:
absences_bins = [0,1,5,100]
pd.cut(student_data_math.absences, absences_bins,right=False)

0      [5, 100)
1        [1, 5)
2      [5, 100)
3        [1, 5)
4        [1, 5)
         ...
390    [5, 100)
391      [1, 5)
392      [1, 5)
393      [0, 1)
394    [5, 100)
Name: absences, Length: 395, dtype: category
Categories (3, interval[int64, left]): [[0, 1) < [1, 5) < [5, 100)]

In [83]:
pd.value_counts(pd.cut(student_data_math.absences, absences_bins,right=False))

[5, 100)    151
[1, 5)      129
[0, 1)      115
Name: absences, dtype: int64

#### 練習問題6-9

In [85]:
pd.value_counts(pd.qcut(student_data_math.absences,3))

(-0.001, 2.0]    183
(6.0, 75.0]      115
(2.0, 6.0]        97
Name: absences, dtype: int64

### 6-2-4 資料的聚合與群組運算

In [10]:
# 準備（確認）資料，不過加上region
df1

    Id      City  Birth_year     Name    region
0  100     Tokyo        1990  Hiroshi     Kanto
1  101     Osaka        1989    Akiko    Kansai
2  102     Kyoto        1992     Yuki    Kansai
3  103  Hollaido        1997   Satoru  Hollaido
4  104     Tokyo        1982  Stteeve     Kanto
5  106     Tokyo        1991   Mituru     Kanto
6  108     Osaka        1988      Aoi    Kansai
7  110     Kyoto        1990    Tarou    Kansai
8  111  Hollaido        1995   Suguru  Hollaido
9  113     Tokyo        1981   Mitsuo     Kanto

In [88]:
# 數量資訊
df1.groupby('City').size()

City
Hollaido    2
Kyoto       2
Osaka       2
Tokyo       4
dtype: int64

In [14]:
# 以City為基準，求得Birth_year的平均值
df1.groupby('City')['Birth_year'].mean()

City
Hollaido    1996.0
Kyoto       1991.0
Osaka       1988.5
Tokyo       1986.0
Name: Birth_year, dtype: float64

In [16]:
# 以region、City為基準，求得Birth_year的平均值
df1.groupby(['region','City'])['Birth_year'].mean()

region    City
Hollaido  Hollaido    1996.0
Kansai    Kyoto       1991.0
          Osaka       1988.5
Kanto     Tokyo       1986.0
Name: Birth_year, dtype: float64

In [17]:
df1.groupby(['region','City'],as_index = False)['Birth_year'].mean()

     region      City  Birth_year
0  Hollaido  Hollaido      1996.0
1    Kansai     Kyoto      1991.0
2    Kansai     Osaka      1988.5
3     Kanto     Tokyo      1986.0

In [19]:
for group,subdf in df1.groupby('region'):
    print('======================================')
    print('Region Name:{0}'.format(group))
    print(subdf)

======================================
Region Name:Hollaido
    Id      City  Birth_year    Name    region
3  103  Hollaido        1997  Satoru  Hollaido
8  111  Hollaido        1995  Suguru  Hollaido
======================================
Region Name:Kansai
    Id   City  Birth_year   Name  region
1  101  Osaka        1989  Akiko  Kansai
2  102  Kyoto        1992   Yuki  Kansai
6  108  Osaka        1988    Aoi  Kansai
7  110  Kyoto        1990  Tarou  Kansai
======================================
Region Name:Kanto
    Id   City  Birth_year     Name region
0  100  Tokyo        1990  Hiroshi  Kanto
4  104  Tokyo        1982  Stteeve  Kanto
5  106  Tokyo        1991   Mituru  Kanto
9  113  Tokyo        1981   Mitsuo  Kanto

In [25]:
# 請移動至含有第3章準備的資料之path。
# 執行下列部分
student_data_math = pd.read_csv('student-mat.csv',sep=';')

# 對行適用多個函式
functions = ['count','mean','max','min']
grouped_stuent_math_data1 = student_data_math.groupby(['sex','address'])
grouped_stuent_math_data1['age','G1'].agg(functions) # 執行functions計算數量、平均、最大、最小值

/var/folders/gr/wkmgmg2d0w7dft51ggc120900000gn/T/ipykernel_1955/3971687036.py:8: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  grouped_stuent_math_data1['age','G1'].agg(functions)

              age                       G1
            count       mean max min count       mean max min
sex address
F   R          44  16.977273  19  15    44  10.295455  19   6
    U         164  16.664634  20  15   164  10.707317  18   4
M   R          44  17.113636  21  15    44  10.659091  18   3
    U         143  16.517483  22  15   143  11.405594  19   5

#### 練習問題6-10

In [26]:
student_data_math.groupby(['school'])['G1'].mean()

school
GP    10.939828
MS    10.673913
Name: G1, dtype: float64

#### 練習問題6-11

In [27]:
student_data_math.groupby(['school','sex'])['G1','G2','G3'].mean()

/var/folders/gr/wkmgmg2d0w7dft51ggc120900000gn/T/ipykernel_1955/988015712.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  student_data_math.groupby(['school','sex'])['G1','G2','G3'].mean()

                   G1         G2         G3
school sex
GP     F    10.579235  10.398907   9.972678
       M    11.337349  11.204819  11.060241
MS     F    10.920000  10.320000   9.920000
       M    10.380952  10.047619   9.761905

In [28]:
MaxMin = ['max','min']
student_data_math.groupby(['school','sex'])['G1','G2','G3'].agg(MaxMin)

/var/folders/gr/wkmgmg2d0w7dft51ggc120900000gn/T/ipykernel_1955/1609900032.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  student_data_math.groupby(['school','sex'])['G1','G2','G3'].agg(MaxMin)

            G1      G2      G3
           max min max min max min
school sex
GP     F    18   4  18   0  19   0
       M    19   3  19   0  20   0
MS     F    19   6  18   5  19   0
       M    15   6  16   5  16   0